index.org
#+title: CAS CS 132
#+subtitle: Geometric Algorithms
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../globalStyle.css" />
#+OPTIONS: html-style:nil H:2 toc:1 num:nil
This course is an introduction to linear algebra with a bent towards
applications in computer science. One of its primary goals is to
prepare students for courses in the CS cirriculum at BU which require
some degree of linear algebra. It is based on (and depends heavily on
the material of) the version of the course taught by [[https://www.cs.bu.edu/fac/crovella/][Mark Crovella]].

* Links
+ Assignments
+ Material
+ Piazza
+ Gradescope
+ Registrar
+ Information
+ Policies
+ *Programming:*
  + python
  + NumPy
  + SciPy
  + matplotlib

* Schedule
|-------+-------------------------+---------------------|
|  Date | Topic                   | Notes               |
|-------+-------------------------+---------------------|
| 09-03 | [[#linear-eqs]]             |                     |
| 09-05 | [[#gauss]]                  | HW01 out            |
|-------+-------------------------+---------------------|
| 09-10 | [[#numerics]]               |                     |
| 09-12 | [[#vec-eqs]]                | HW01 due, HW02 out  |
|-------+-------------------------+---------------------|
| 09-17 | [[#mat-vec-eqs]]            |                     |
| 09-19 | [[#linear-ind]]             | HW02 due, HW03 out  |
|-------+-------------------------+---------------------|
| 09-24 | [[#linear-trans]]           |                     |
| 09-26 | [[#mat-linear-trans]]       | HW03 due, HW04 out  |
|-------+-------------------------+---------------------|
| 10-01 | [[#numerics-ii]]            |                     |
| 10-03 | [[#matrix-alg]]             | HW04 due, HW05 out  |
|-------+-------------------------+---------------------|
| 10-08 | [[#matrix-inv]]             |                     |
| 10-10 | [[#inv-mat-thm]]            | HW05 due, HW06 out  |
|-------+-------------------------+---------------------|
| 10-15 | NO CLASS                | Substitute Monday   |
| 10-17 | [[#algebraic-graph-theory]] | HW06 due            |
|-------+-------------------------+---------------------|
| 10-22 | MIDTERM                 |                     |
| 10-24 | [[#markov-chains]]          | HW07 out            |
|-------+-------------------------+---------------------|
| 10-29 | [[#matrix-fact]]            |                     |
| 10-31 | [[#graphics]]               | HW07 due, HW08 out  |
|-------+-------------------------+---------------------|
| 11-05 | [[#subspaces]]              |                     |
| 11-07 | [[#dim-rank]]               | HW08 due, HW09 out  |
|-------+-------------------------+---------------------|
| 11-12 | [[#eigenvectors]]           |                     |
| 11-14 | [[#char-eq]]                | HW09 due, HW10 out  |
|-------+-------------------------+---------------------|
| 11-19 | [[#diagonalization]]        |                     |
| 11-21 | [[#ortho]]                  | HW10 due, HW11 out  |
|-------+-------------------------+---------------------|
| 11-26 | [[#pagerank]]               |                     |
| 11-28 | NO CLASS                | Thanksgiving Recess |
|-------+-------------------------+---------------------|
| 12-03 | [[#ortho-proj]]             |                     |
| 12-05 | [[#least-sqs]]              | HW11 due, HW12 out  |
|-------+-------------------------+---------------------|
| 12-10 | [[#linear-models]]          |                     |
| 12-12 | [[#sym-matrix]]             | HW12 due            |
|-------+-------------------------+---------------------|
|   TBD | FINAL EXAM              |                     |
|-------+-------------------------+---------------------|

* Course Staff
+ *Instructor:* Nathan Mull
+ *Teaching Fellows:*
  + TBD
+ *Teaching Assistants:*
  + TBD
+ *Course Assistants:*
  + TBD

* Topics
** Linear Equations
:PROPERTIES:
:CUSTOM_ID: linear-eqs
:END:
** Gaussian Elimination
:PROPERTIES:
:CUSTOM_ID: gauss
:END:
** Numerics and NumPy (Part I)
:PROPERTIES:
:CUSTOM_ID: numerics
:END:
** Vector Equations
:PROPERTIES:
:CUSTOM_ID: vec-eqs
:END:
** Matrix-Vector Equations
:PROPERTIES:
:CUSTOM_ID: mat-vec-eqs
:END:
** Linear Independence
:PROPERTIES:
:CUSTOM_ID: linear-ind
:END:
** Linear Transformations
:PROPERTIES:
:CUSTOM_ID: linear-trans
:END:
** Matrices of Linear Transformations
:PROPERTIES:
:CUSTOM_ID: mat-linear-trans
:END:
** Matrix Algebra
:PROPERTIES:
:CUSTOM_ID: matrix-alg
:END:
** Numerics and NumPy (Part II)
:PROPERTIES:
:CUSTOM_ID: numerics-ii
:END:
** Matrix Inverse
:PROPERTIES:
:CUSTOM_ID: matrix-inv
:END:
** Invertible Matrix Theorem
:PROPERTIES:
:CUSTOM_ID: inv-mat-thm
:END:
** Markov Chains
:PROPERTIES:
:CUSTOM_ID: markov-chains
:END:
** Matrix Factorization
:PROPERTIES:
:CUSTOM_ID: matrix-fact
:END:
** Computer Graphics
:PROPERTIES:
:CUSTOM_ID: graphics
:END:
** Subspaces
:PROPERTIES:
:CUSTOM_ID: subspaces
:END:
** Dimension and Rank
:PROPERTIES:
:CUSTOM_ID: dim-rank
:END:
** Eigenvalues and Eigenvectors
:PROPERTIES:
:CUSTOM_ID: eigenvectors
:END:
** The Characteristic Equation
:PROPERTIES:
:CUSTOM_ID: char-eq
:END:
** Algebraic Graph Theory
:PROPERTIES:
:CUSTOM_ID: algebraic-graph-theory
:END:
** Diagonalization
:PROPERTIES:
:CUSTOM_ID: diagonalization
:END:
** Orthogonality
:PROPERTIES:
:CUSTOM_ID: ortho
:END:
** PageRank
:PROPERTIES:
:CUSTOM_ID: pagerank
:END:
** Orthogonal Projection
:PROPERTIES:
:CUSTOM_ID: ortho-proj
:END:
** Least Squares
:PROPERTIES:
:CUSTOM_ID: least-sqs
:END:
** Linear Models
:PROPERTIES:
:CUSTOM_ID: linear-models
:END:
** Symmetric Matrices
:PROPERTIES:
:CUSTOM_ID: sym-matrix
:END:
** Singular Value Decomposition
:PROPERTIES:
:CUSTOM_ID: svd
:END:
