index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-29 Wed 11:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CAS CS 132</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../globalStyle.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CAS CS 132
<br />
<span class="subtitle">Geometric Algorithms</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b4bfaa">Links</a></li>
<li><a href="#org941f4b2">Schedule</a></li>
<li><a href="#org476c78b">Course Staff</a></li>
<li><a href="#org0abff27">Topics</a></li>
</ul>
</div>
</div>
<p>
This course is an introduction to linear algebra with a bent towards
applications in computer science. One of its primary goals is to
prepare students for courses in the CS cirriculum at BU which require
some degree of linear algebra. It is based on (and depends heavily on
the material of) the version of the course taught by <a href="https://www.cs.bu.edu/fac/crovella/">Mark Crovella</a>.
</p>

<div id="outline-container-org1b4bfaa" class="outline-2">
<h2 id="org1b4bfaa">Links</h2>
<div class="outline-text-2" id="text-org1b4bfaa">
<ul class="org-ul">
<li>Assignments</li>
<li>Material</li>
<li>Piazza</li>
<li>Gradescope</li>
<li>Registrar</li>
<li>Information</li>
<li>Policies</li>
<li><b>Programming:</b>
<ul class="org-ul">
<li>python</li>
<li>NumPy</li>
<li>SciPy</li>
<li>matplotlib</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org941f4b2" class="outline-2">
<h2 id="org941f4b2">Schedule</h2>
<div class="outline-text-2" id="text-org941f4b2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Date</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">09-03</td>
<td class="org-left"><a href="#linear-eqs">Linear Equations</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">09-05</td>
<td class="org-left"><a href="#gauss">Gaussian Elimination</a></td>
<td class="org-left">HW01 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">09-10</td>
<td class="org-left"><a href="#numerics">Numerics and NumPy (Part I)</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">09-12</td>
<td class="org-left"><a href="#vec-eqs">Vector Equations</a></td>
<td class="org-left">HW01 due, HW02 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">09-17</td>
<td class="org-left"><a href="#mat-vec-eqs">Matrix-Vector Equations</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">09-19</td>
<td class="org-left"><a href="#linear-ind">Linear Independence</a></td>
<td class="org-left">HW02 due, HW03 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">09-24</td>
<td class="org-left"><a href="#linear-trans">Linear Transformations</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">09-26</td>
<td class="org-left"><a href="#mat-linear-trans">Matrices of Linear Transformations</a></td>
<td class="org-left">HW03 due, HW04 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">10-01</td>
<td class="org-left"><a href="#numerics-ii">Numerics and NumPy (Part II)</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10-03</td>
<td class="org-left"><a href="#matrix-alg">Matrix Algebra</a></td>
<td class="org-left">HW04 due, HW05 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">10-08</td>
<td class="org-left"><a href="#matrix-inv">Matrix Inverse</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10-10</td>
<td class="org-left"><a href="#inv-mat-thm">Invertible Matrix Theorem</a></td>
<td class="org-left">HW05 due, HW06 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">10-15</td>
<td class="org-left">NO CLASS</td>
<td class="org-left">Substitute Monday</td>
</tr>

<tr>
<td class="org-right">10-17</td>
<td class="org-left"><a href="#algebraic-graph-theory">Algebraic Graph Theory</a></td>
<td class="org-left">HW06 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">10-22</td>
<td class="org-left">MIDTERM</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10-24</td>
<td class="org-left"><a href="#markov-chains">Markov Chains</a></td>
<td class="org-left">HW07 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">10-29</td>
<td class="org-left"><a href="#matrix-fact">Matrix Factorization</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10-31</td>
<td class="org-left"><a href="#graphics">Computer Graphics</a></td>
<td class="org-left">HW07 due, HW08 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">11-05</td>
<td class="org-left"><a href="#subspaces">Subspaces</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11-07</td>
<td class="org-left"><a href="#dim-rank">Dimension and Rank</a></td>
<td class="org-left">HW08 due, HW09 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">11-12</td>
<td class="org-left"><a href="#eigenvectors">Eigenvalues and Eigenvectors</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11-14</td>
<td class="org-left"><a href="#char-eq">The Characteristic Equation</a></td>
<td class="org-left">HW09 due, HW10 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">11-19</td>
<td class="org-left"><a href="#diagonalization">Diagonalization</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11-21</td>
<td class="org-left"><a href="#ortho">Orthogonality</a></td>
<td class="org-left">HW10 due, HW11 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">11-26</td>
<td class="org-left"><a href="#pagerank">PageRank</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11-28</td>
<td class="org-left">NO CLASS</td>
<td class="org-left">Thanksgiving Recess</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">12-03</td>
<td class="org-left"><a href="#ortho-proj">Orthogonal Projection</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">12-05</td>
<td class="org-left"><a href="#least-sqs">Least Squares</a></td>
<td class="org-left">HW11 due, HW12 out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">12-10</td>
<td class="org-left"><a href="#linear-models">Linear Models</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">12-12</td>
<td class="org-left"><a href="#sym-matrix">Symmetric Matrices</a></td>
<td class="org-left">HW12 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">TBD</td>
<td class="org-left">FINAL EXAM</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org476c78b" class="outline-2">
<h2 id="org476c78b">Course Staff</h2>
<div class="outline-text-2" id="text-org476c78b">
<ul class="org-ul">
<li><b>Instructor:</b> Nathan Mull</li>
<li><b>Teaching Fellows:</b>
<ul class="org-ul">
<li>TBD</li>
</ul></li>
<li><b>Teaching Assistants:</b>
<ul class="org-ul">
<li>TBD</li>
</ul></li>
<li><b>Course Assistants:</b>
<ul class="org-ul">
<li>TBD</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0abff27" class="outline-2">
<h2 id="org0abff27">Topics</h2>
<div class="outline-text-2" id="text-org0abff27">
</div>
<div id="outline-container-linear-eqs" class="outline-3">
<h3 id="linear-eqs">Linear Equations</h3>
<div class="outline-text-3" id="text-linear-eqs">
</div>
</div>
<div id="outline-container-gauss" class="outline-3">
<h3 id="gauss">Gaussian Elimination</h3>
<div class="outline-text-3" id="text-gauss">
</div>
</div>
<div id="outline-container-numerics" class="outline-3">
<h3 id="numerics">Numerics and NumPy (Part I)</h3>
<div class="outline-text-3" id="text-numerics">
</div>
</div>
<div id="outline-container-vec-eqs" class="outline-3">
<h3 id="vec-eqs">Vector Equations</h3>
<div class="outline-text-3" id="text-vec-eqs">
</div>
</div>
<div id="outline-container-mat-vec-eqs" class="outline-3">
<h3 id="mat-vec-eqs">Matrix-Vector Equations</h3>
<div class="outline-text-3" id="text-mat-vec-eqs">
</div>
</div>
<div id="outline-container-linear-ind" class="outline-3">
<h3 id="linear-ind">Linear Independence</h3>
<div class="outline-text-3" id="text-linear-ind">
</div>
</div>
<div id="outline-container-linear-trans" class="outline-3">
<h3 id="linear-trans">Linear Transformations</h3>
<div class="outline-text-3" id="text-linear-trans">
</div>
</div>
<div id="outline-container-mat-linear-trans" class="outline-3">
<h3 id="mat-linear-trans">Matrices of Linear Transformations</h3>
<div class="outline-text-3" id="text-mat-linear-trans">
</div>
</div>
<div id="outline-container-matrix-alg" class="outline-3">
<h3 id="matrix-alg">Matrix Algebra</h3>
<div class="outline-text-3" id="text-matrix-alg">
</div>
</div>
<div id="outline-container-numerics-ii" class="outline-3">
<h3 id="numerics-ii">Numerics and NumPy (Part II)</h3>
<div class="outline-text-3" id="text-numerics-ii">
</div>
</div>
<div id="outline-container-matrix-inv" class="outline-3">
<h3 id="matrix-inv">Matrix Inverse</h3>
<div class="outline-text-3" id="text-matrix-inv">
</div>
</div>
<div id="outline-container-inv-mat-thm" class="outline-3">
<h3 id="inv-mat-thm">Invertible Matrix Theorem</h3>
<div class="outline-text-3" id="text-inv-mat-thm">
</div>
</div>
<div id="outline-container-markov-chains" class="outline-3">
<h3 id="markov-chains">Markov Chains</h3>
<div class="outline-text-3" id="text-markov-chains">
</div>
</div>
<div id="outline-container-matrix-fact" class="outline-3">
<h3 id="matrix-fact">Matrix Factorization</h3>
<div class="outline-text-3" id="text-matrix-fact">
</div>
</div>
<div id="outline-container-graphics" class="outline-3">
<h3 id="graphics">Computer Graphics</h3>
<div class="outline-text-3" id="text-graphics">
</div>
</div>
<div id="outline-container-subspaces" class="outline-3">
<h3 id="subspaces">Subspaces</h3>
<div class="outline-text-3" id="text-subspaces">
</div>
</div>
<div id="outline-container-dim-rank" class="outline-3">
<h3 id="dim-rank">Dimension and Rank</h3>
<div class="outline-text-3" id="text-dim-rank">
</div>
</div>
<div id="outline-container-eigenvectors" class="outline-3">
<h3 id="eigenvectors">Eigenvalues and Eigenvectors</h3>
<div class="outline-text-3" id="text-eigenvectors">
</div>
</div>
<div id="outline-container-char-eq" class="outline-3">
<h3 id="char-eq">The Characteristic Equation</h3>
<div class="outline-text-3" id="text-char-eq">
</div>
</div>
<div id="outline-container-algebraic-graph-theory" class="outline-3">
<h3 id="algebraic-graph-theory">Algebraic Graph Theory</h3>
<div class="outline-text-3" id="text-algebraic-graph-theory">
</div>
</div>
<div id="outline-container-diagonalization" class="outline-3">
<h3 id="diagonalization">Diagonalization</h3>
<div class="outline-text-3" id="text-diagonalization">
</div>
</div>
<div id="outline-container-ortho" class="outline-3">
<h3 id="ortho">Orthogonality</h3>
<div class="outline-text-3" id="text-ortho">
</div>
</div>
<div id="outline-container-pagerank" class="outline-3">
<h3 id="pagerank">PageRank</h3>
<div class="outline-text-3" id="text-pagerank">
</div>
</div>
<div id="outline-container-ortho-proj" class="outline-3">
<h3 id="ortho-proj">Orthogonal Projection</h3>
<div class="outline-text-3" id="text-ortho-proj">
</div>
</div>
<div id="outline-container-least-sqs" class="outline-3">
<h3 id="least-sqs">Least Squares</h3>
<div class="outline-text-3" id="text-least-sqs">
</div>
</div>
<div id="outline-container-linear-models" class="outline-3">
<h3 id="linear-models">Linear Models</h3>
<div class="outline-text-3" id="text-linear-models">
</div>
</div>
<div id="outline-container-sym-matrix" class="outline-3">
<h3 id="sym-matrix">Symmetric Matrices</h3>
<div class="outline-text-3" id="text-sym-matrix">
</div>
</div>
<div id="outline-container-svd" class="outline-3">
<h3 id="svd">Singular Value Decomposition</h3>
<div class="outline-text-3" id="text-svd">
</div>
</div>
</div>
</div>
</body>
</html>
